Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg54/atdf/ATSAMG54J19.atdf
        <module name="RSTC" id="11009" version="I">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="6056" version="S">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTT" id="6081" version="M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI" id="6088" version="ZE">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA12" function="A" group="MISO"/>
              <signal pad="PA13" function="A" group="MOSI"/>
              <signal pad="PA11" function="A" group="NPCS" index="0"/>
              <signal pad="PA5" function="B" group="NPCS" index="1"/>
              <signal pad="PB2" function="B" group="NPCS" index="1"/>
              <signal pad="PA14" function="A" group="SPCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="13"/>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="INSTANCE_ID" value="21"/>
              <param name="CLOCK_ID" value="21"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="11228" version="E">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
            <signals>
              <signal pad="PA0" function="X1" group="WKUP" index="0"/>
              <signal pad="PA1" function="X1" group="WKUP" index="1"/>
              <signal pad="PA2" function="X1" group="WKUP" index="2"/>
              <signal pad="PA23" function="X1" group="WKUP" index="3"/>
              <signal pad="PA5" function="X1" group="WKUP" index="4"/>
              <signal pad="PA8" function="X1" group="WKUP" index="5"/>
              <signal pad="PA9" function="X1" group="WKUP" index="6"/>
              <signal pad="PA16" function="X1" group="WKUP" index="7"/>
              <signal pad="PA14" function="X1" group="WKUP" index="8"/>
              <signal pad="PA21" function="X1" group="WKUP" index="9"/>
              <signal pad="PA22" function="X1" group="WKUP" index="10"/>
              <signal pad="PA24" function="X1" group="WKUP" index="11"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="WKUP" index="13"/>
              <signal pad="PB8" function="X1" group="WKUP" index="14"/>
              <signal pad="PB9" function="X1" group="WKUP" index="15"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZB">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA2" function="A" group="TCLK" index="0"/>
              <signal pad="PA19" function="A" group="TCLK" index="1"/>
              <signal pad="PA20" function="A" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA23" function="B" group="TIOA" index="1"/>
              <signal pad="PA21" function="A" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA22" function="A" group="TIOB" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="14"/>
              <param name="INSTANCE_ID_CHANNEL0" value="23"/>
              <param name="INSTANCE_ID_CHANNEL1" value="24"/>
              <param name="INSTANCE_ID_CHANNEL2" value="25"/>
              <param name="CLOCK_ID_CHANNEL0" value="23"/>
              <param name="CLOCK_ID_CHANNEL1" value="24"/>
              <param name="CLOCK_ID_CHANNEL2" value="25"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="MCK/2"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="16"/>
              <param name="QDEC_PRESENT" value="0"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40014000"/>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="26"/>
              <param name="INSTANCE_ID_CHANNEL1" value="27"/>
              <param name="INSTANCE_ID_CHANNEL2" value="28"/>
              <param name="CLOCK_ID_CHANNEL0" value="26"/>
              <param name="CLOCK_ID_CHANNEL1" value="27"/>
              <param name="CLOCK_ID_CHANNEL2" value="28"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="MCK/2"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="16"/>
              <param name="QDEC_PRESENT" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TWI" id="6212" version="Z">
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB9" function="A" group="TWCK" index="1"/>
              <signal pad="PB11" function="A" group="TWCK" index="1"/>
              <signal pad="PB8" function="A" group="TWD" index="1"/>
              <signal pad="PB10" function="A" group="TWD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="DMAC_ID_TX" value="25"/>
              <param name="INSTANCE_ID" value="20"/>
              <param name="CLOCK_ID" value="20"/>
            </parameters>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0x40040000"/>
            <signals>
              <signal pad="PB1" function="B" group="TWCK" index="2"/>
              <signal pad="PB11" function="B" group="TWCK" index="2"/>
              <signal pad="PB0" function="B" group="TWD" index="2"/>
              <signal pad="PB10" function="B" group="TWD" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="11"/>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
            </parameters>
          </instance>
        </module>
