Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg54/atdf/ATSAMG54J19.atdf
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="Brownout Detector Reset Status (cleared on read)" mask="0x00000008" name="BODRSTS" values="SUPC_SR__BODRSTS"/>
          <bitfield caption="Supply Monitor Reset Status (cleared on read)" mask="0x00000010" name="SMRSTS" values="SUPC_SR__SMRSTS"/>
          <bitfield caption="Supply Monitor Status (cleared on read)" mask="0x00000020" name="SMS" values="SUPC_SR__SMS"/>
          <bitfield caption="Supply Monitor Output Status" mask="0x00000040" name="SMOS" values="SUPC_SR__SMOS"/>
          <bitfield caption="32-kHz Oscillator Selection Status" mask="0x00000080" name="OSCSEL" values="SUPC_SR__OSCSEL"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__XTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, switches the slow clock on the crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMTH">
        <value caption="1.6 V" name="V1P6" value="0x0"/>
        <value caption="1.72 V" name="V1P72" value="0x1"/>
        <value caption="1.84 V" name="V1P84" value="0x2"/>
        <value caption="1.96 V" name="V1P96" value="0x3"/>
        <value caption="2.08 V" name="V2P08" value="0x4"/>
        <value caption="2.2 V" name="V2P2" value="0x5"/>
        <value caption="2.32 V" name="V2P32" value="0x6"/>
        <value caption="2.44 V" name="V2P44" value="0x7"/>
        <value caption="2.56 V" name="V2P56" value="0x8"/>
        <value caption="2.68 V" name="V2P68" value="0x9"/>
        <value caption="2.8 V" name="V2P8" value="0xA"/>
        <value caption="2.92 V" name="V2P92" value="0xB"/>
        <value caption="3.04 V" name="V3P04" value="0xC"/>
        <value caption="3.16 V" name="V3P16" value="0xD"/>
        <value caption="3.28 V" name="V3P28" value="0xE"/>
        <value caption="3.4 V" name="V3P4" value="0xF"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enables one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enables one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enables one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="The SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__VDDSEL">
        <value caption="The voltage regulator output value is the factory-programmed value." name="FACTORY" value="0"/>
        <value caption="The voltage regulator output value is defined by the value programmed in the field VRVDD." name="USER_VRVDD" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__VRVDD">
        <value caption="The voltage regulator output value is the factory-programmed value." name="FACTORY" value="0"/>
        <value caption="The voltage regulator output value is defined by the value programmed in the field VRVDD." name="USER_VRVDD" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal vddcore_nreset is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="The core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="The core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__PSWITCH1">
        <value caption="The SRAM1 is not powered." name="OFF" value="0"/>
        <value caption="The SRAM1 is powered." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__PSWITCH2">
        <value caption="The SRAM2 is not powered." name="OFF" value="0"/>
        <value caption="The SRAM2 is powered." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="No core brownout rising edge event has been detected since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="No supply monitor detection has generated a core reset since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
