Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg54/atdf/ATSAMG54J19.atdf
      <register-group name="TC">
        <register-group caption="Channel Control Register (channel = 0)" offset="0x0" count="3" name="TC_CHANNEL" size="64" name-in-module="TC_CHANNEL"/>
        <register caption="Block Control Register" name="TC_BCR" offset="0xC0" rw="W" size="4">
          <bitfield caption="Synchro Command" mask="0x00000001" name="SYNC"/>
        </register>
        <register caption="Block Mode Register" name="TC_BMR" offset="0xC4" rw="RW" size="4">
          <bitfield caption="External Clock Signal 0 Selection" mask="0x00000003" name="TC0XC0S" values="TC_BMR__TC0XC0S"/>
          <bitfield caption="External Clock Signal 1 Selection" mask="0x0000000C" name="TC1XC1S" values="TC_BMR__TC1XC1S"/>
          <bitfield caption="External Clock Signal 2 Selection" mask="0x00000030" name="TC2XC2S" values="TC_BMR__TC2XC2S"/>
        </register>
        <register caption="Write Protection Mode Register" name="TC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TC_WPMR__WPKEY"/>
        </register>
        <register caption="Receive Pointer Register (pdc = 0)" name="TC_RPR0" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Next Pointer Register (pdc = 0)" name="TC_RNPR0" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register (pdc = 0)" name="TC_RNCR0" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register (pdc = 0)" name="TC_PTCR0" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register (pdc = 0)" name="TC_PTSR0" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="TC_CMR0__TCCLKS">
        <value caption="Clock selected: internal TIMER_CLOCK1 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal TIMER_CLOCK2 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal TIMER_CLOCK3 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal TIMER_CLOCK4 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal TIMER_CLOCK5 clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edges" name="EDGE" value="0x3"/>
      </value-group>
