Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg54/atdf/ATSAMG54J19.atdf
        <register caption="Write Protection Mode Register" name="US_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="US_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="US_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="US_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="US_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="US_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="US_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="US_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="US_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="US_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="US_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="US_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="US_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485 mode" name="RS485" value="0x1"/>
        <value caption="Hardware Handshaking" name="HW_HANDSHAKING" value="0x2"/>
        <value caption="SPI master mode" name="SPI_MASTER" value="0xE"/>
        <value caption="SPI Slave mode" name="SPI_SLAVE" value="0xF"/>
      </value-group>
      <value-group caption="" name="US_MR__USCLKS">
        <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
        <value caption="Peripheral clock divided (DIV=8) is selected" name="DIV" value="0x1"/>
        <value caption="Serial clock (SCK) is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MR__CHRL">
        <value caption="Character length is 5 bits" name="_5_BIT" value="0x0"/>
        <value caption="Character length is 6 bits" name="_6_BIT" value="0x1"/>
        <value caption="Character length is 7 bits" name="_7_BIT" value="0x2"/>
        <value caption="Character length is 8 bits" name="_8_BIT" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Parity forced to 0 (Space)" name="SPACE" value="0x2"/>
        <value caption="Parity forced to 1 (Mark)" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
        <value caption="Multidrop mode" name="MULTIDROP" value="0x6"/>
      </value-group>
      <value-group caption="" name="US_MR__NBSTOP">
        <value caption="1 stop bit" name="_1_BIT" value="0x0"/>
        <value caption="1.5 stop bits (SYNC = 0) or reserved (SYNC = 1)" name="_1_5_BIT" value="0x1"/>
        <value caption="2 stop bits" name="_2_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="US_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo. Receiver input is connected to the TXD pin." name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback. Transmitter output is connected to the Receiver Input." name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin." name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x555341"/>
      </value-group>
    </module>
    <module name="WDT" caption="Watchdog Timer" id="6080" version="H">
      <register-group name="WDT">
        <register caption="Control Register" name="WDT_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Password." mask="0xFF000000" name="KEY" values="WDT_CR__KEY"/>
        </register>
        <register caption="Mode Register" name="WDT_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
          <bitfield caption="Watchdog Fault Interrupt Enable" mask="0x00001000" name="WDFIEN"/>
          <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
          <bitfield caption="Watchdog Reset Processor" mask="0x00004000" name="WDRPROC"/>
          <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
          <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
          <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
        </register>
        <register caption="Status Register" name="WDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error" mask="0x00000002" name="WDERR"/>
        </register>
      </register-group>
      <value-group caption="" name="WDT_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module name="FUSES" id="1" version="1">
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register caption="GPNVM Bits" name="GPNVMBITS" offset="0x0" rw="RW" size="1">
          <bitfield caption="Security Bit" mask="0x00000001" name="SECURITY_BIT" rw="R"/>
          <bitfield caption="Boot Mode Selection" mask="0x00000002" name="BOOT_MODE"/>
        </register>
      </register-group>
    </module>
    <module name="LOCKBIT" id="1" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits Word 0" name="LOCKBIT_WORD0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
          <bitfield caption="Lock Region 8" mask="0x00000100" name="LOCK_REGION_8"/>
          <bitfield caption="Lock Region 9" mask="0x00000200" name="LOCK_REGION_9"/>
          <bitfield caption="Lock Region 10" mask="0x00000400" name="LOCK_REGION_10"/>
          <bitfield caption="Lock Region 11" mask="0x00000800" name="LOCK_REGION_11"/>
          <bitfield caption="Lock Region 12" mask="0x00001000" name="LOCK_REGION_12"/>
          <bitfield caption="Lock Region 13" mask="0x00002000" name="LOCK_REGION_13"/>
          <bitfield caption="Lock Region 14" mask="0x00004000" name="LOCK_REGION_14"/>
          <bitfield caption="Lock Region 15" mask="0x00008000" name="LOCK_REGION_15"/>
          <bitfield caption="Lock Region 16" mask="0x00010000" name="LOCK_REGION_16"/>
          <bitfield caption="Lock Region 17" mask="0x00020000" name="LOCK_REGION_17"/>
          <bitfield caption="Lock Region 18" mask="0x00040000" name="LOCK_REGION_18"/>
          <bitfield caption="Lock Region 19" mask="0x00080000" name="LOCK_REGION_19"/>
          <bitfield caption="Lock Region 20" mask="0x00100000" name="LOCK_REGION_20"/>
          <bitfield caption="Lock Region 21" mask="0x00200000" name="LOCK_REGION_21"/>
          <bitfield caption="Lock Region 22" mask="0x00400000" name="LOCK_REGION_22"/>
          <bitfield caption="Lock Region 23" mask="0x00800000" name="LOCK_REGION_23"/>
          <bitfield caption="Lock Region 24" mask="0x01000000" name="LOCK_REGION_24"/>
          <bitfield caption="Lock Region 25" mask="0x02000000" name="LOCK_REGION_25"/>
          <bitfield caption="Lock Region 26" mask="0x04000000" name="LOCK_REGION_26"/>
          <bitfield caption="Lock Region 27" mask="0x08000000" name="LOCK_REGION_27"/>
          <bitfield caption="Lock Region 28" mask="0x10000000" name="LOCK_REGION_28"/>
          <bitfield caption="Lock Region 29" mask="0x20000000" name="LOCK_REGION_29"/>
          <bitfield caption="Lock Region 30" mask="0x40000000" name="LOCK_REGION_30"/>
          <bitfield caption="Lock Region 31" mask="0x80000000" name="LOCK_REGION_31"/>
        </register>
