Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg54/atdf/ATSAMG54J19.atdf
        <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
          <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
          <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
        </register>
        <register offset="0x00000008" size="4" name="MPU_RNR" initval="0x00000000" caption="MPU Region Number Register" rw="RW">
          <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
        </register>
        <register offset="0x0000000C" size="4" name="MPU_RBAR" initval="0x00000000" caption="MPU Region Base Address Register" rw="RW">
          <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
          <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
          <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
        </register>
        <register offset="0x00000010" size="4" name="MPU_RASR" initval="0x00000000" caption="MPU Region Attribute and Size Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
          <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
          <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
          <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
          <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
          <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
          <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
          <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
          <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
        </register>
      </register-group>
    </module>
    <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
  </modules>
  <pinouts>
    <pinout name="QFN64">
      <pin position="6" pad="PA0"/>
      <pin position="7" pad="PA1"/>
      <pin position="61" pad="PA2"/>
      <pin position="5" pad="PA3"/>
      <pin position="4" pad="PA4"/>
      <pin position="8" pad="PA5"/>
      <pin position="17" pad="PA6"/>
      <pin position="11" pad="PA7"/>
      <pin position="12" pad="PA8"/>
      <pin position="49" pad="PA9"/>
      <pin position="48" pad="PA10"/>
      <pin position="44" pad="PA11"/>
      <pin position="43" pad="PA12"/>
      <pin position="42" pad="PA13"/>
      <pin position="41" pad="PA14"/>
      <pin position="22" pad="PA15"/>
      <pin position="18" pad="PA16"/>
      <pin position="33" pad="PA17"/>
      <pin position="34" pad="PA18"/>
      <pin position="35" pad="PA19"/>
      <pin position="36" pad="PA20"/>
      <pin position="25" pad="PA21"/>
      <pin position="24" pad="PA22"/>
      <pin position="23" pad="PA23"/>
      <pin position="58" pad="PA24"/>
      <pin position="56" pad="PA25"/>
      <pin position="52" pad="PA26"/>
      <pin position="51" pad="PA27"/>
      <pin position="21" pad="PA28"/>
      <pin position="20" pad="PA29"/>
      <pin position="19" pad="PA30"/>
      <pin position="16" pad="PA31"/>
      <pin position="37" pad="PB0"/>
      <pin position="38" pad="PB1"/>
      <pin position="39" pad="PB2"/>
      <pin position="40" pad="PB3"/>
      <pin position="62" pad="PB4"/>
      <pin position="50" pad="PB5"/>
      <pin position="54" pad="PB6"/>
      <pin position="55" pad="PB7"/>
      <pin position="59" pad="PB8"/>
      <pin position="60" pad="PB9"/>
      <pin position="46" pad="PB10"/>
      <pin position="47" pad="PB11"/>
      <pin position="3" pad="PB12"/>
      <pin position="30" pad="VDDOUT"/>
      <pin position="2" pad="NRST"/>
      <pin position="10" pad="TEST"/>
      <pin position="31" pad="VDDIO"/>
      <pin position="32" pad="VDDIO"/>
      <pin position="27" pad="VDDIO"/>
      <pin position="64" pad="VDDIO"/>
      <pin position="1" pad="VDDIO"/>
      <pin position="63" pad="JTAGSEL"/>
      <pin position="9" pad="VDDCORE"/>
      <pin position="45" pad="VDDCORE"/>
      <pin position="53" pad="GND"/>
      <pin position="13" pad="GND"/>
      <pin position="29" pad="GND"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
